window.translations ={
            'nav-home': 'الرئيسية',
            'nav-about': 'من أنا!',
            'nav-contact': 'تواصل معي',
            'nav-education': 'التعليم',
            'nav-experience': 'الخبرة',
            'nav-projects': 'المشاريع',
            'nav-skills': 'المهارات',
            'nav-certificates': 'الشهادات',
            'nav-languages': 'اللغات',

            'profile-name': 'س ح ',

            'meta-description': 'استكشف ملف الأعمال الخاص بس ح، مهندس سحاب معتمد كمهندس حلول من AWS. اكتشف المشاريع، والمهارات في تقنيات الحوسبة السحابية مثل AWS و Terraform، والخبرة المهنية.',
            'meta-keywords': 'مجمل أعمال, س ح | مهندس سحابة, HTML, CSS, JavaScript, تطوير الويب,   البنى السحابية,   , السيرة الذاتية  ,   ',
            'meta-image-alt': 'مجمل أعمال س ح',
           
            'copyright': '&copy; Portfolio Owner',

            'error-header': 'الصفحة غير موجودة',
            'error-message': 'الصفحة التي تبحث عنها ربما تمت إزالتها أو تغيير اسمها أو أنها غير متوفرة مؤقتاً.',
            'error-home-link': 'العودة للصفحة الرئيسية',
            
            'og-title': 'س ح | مهندس سحابة معتمد',
            'og-description': 'ملف أعمال احترافي يتضمن مشاريع في هندسة السحابة، شهادات AWS وخبرة في DevOps.',
            'og-image-alt': 'س ح - ملف مهندس السحابة',

            'meta-title': 'AWS س ح | مشروع سحابة',
            
            "project-1-profile-title": "استضافة موقع إلكتروني على AWS",
            "project-1-page-title": "استضافة موقع إلكتروني ثابت على AWS | س ح",
          
            "project-1-title": "استضافة موقع إلكتروني  على خدمات AWS",
            
            "project-1-short-desc": "إنشاء استضافة بنية تحتية سحابية عالية التوفر وقابلة للتوسع للمواقع الثابتة.",
            "project-1-intro-title": "مقدمة",
            "project-1-intro-desc": "يُعدّ إنشاء موقع إلكتروني ثابت على خدمات AWS خيارًا مثاليًا للمشاريع التي لا تتطلب قاعدة بيانات أو منطقًا معقدًا على الخادم. توفر هذه الطريقة أداءً عاليًا، وتكلفة منخفضة، وقابلية للتوسع. يتكون هذا المشروع من عدة خدمات من AWS تعمل معًا لتقديم تجربة تصفح سريعة وآمنة للمستخدمين.",
            "project-1-benefit-title": "الاستفادة من المشروع",
            "project-1-benefit-desc": "تتيح هذه البنية استضافة مواقع ثابتة مثل المدونات الشخصية، صفحات الهبوط (landing pages)، والمواقع التعريفية للشركات. من أهم مميزاتها أنها توفر تجربة تصفح سريعة للمستخدمين من مختلف أنحاء العالم، وتقلل من التكاليف التشغيلية بشكل كبير مقارنةً بالحلول التقليدية.",
            "project-1-steps-title": "خطوات تنفيذ مختصرة",
            "project-1-step-1": "إنشاء المحتوى: تبدأ العملية بإنشاء ملفات الموقع الثابت (HTML, CSS, JS) وتسمية الصفحة الرئيسية index.html.",
         
            "project-1-features-title": "مميزات المشروع",
            "project-1-feature-1": "قابلية التوسع: يمكن للموقع التعامل مع عدد كبير جدًا من الزوار دون الحاجة إلى تغيير البنية.",
         
            "project-1-tech-title": "التقنيات المستخدمة",
            "project-1-tech-1": "HTML/CSS/JS: لإنشاء محتوى الموقع الثابت.",
          
            "project-screenshots": "لقطات شاشة",
            "project-1-img1-alt": "رسم توضيحي للبنية التحتية على AWS",
            "project-1-img2-alt": "رسم بياني يوضح سير عمل CI/CD",
            "project-1-links": "روابط",
            "project-1-github-link": "مستودع GitHub",
            "project-1-demo-link": "عرض حي",

}